Same issue here but using `subnet` although it is already documented in [lb#subnets](https://registry.terraform.io/providers/hashicorp/aws/latest/docs/resources/lb#subnets)
Scaling out my project from 3 availability zone to 4 AZ got the following
```
/+ resource "aws_lb" "cf-proxy" {
      ~ arn                              = "XXXXXXX" -> (known after apply)
      ~ arn_suffix                       = "XXXXXXX" -> (known after apply)
      ~ dns_name                         = "XXXXXXX" -> (known after apply)
        enable_cross_zone_load_balancing = false
        enable_deletion_protection       = false
      ~ id                               = "XXXXXXX" -> (known after apply)
      ~ internal                         = false -> (known after apply)
      ~ ip_address_type                  = "ipv4" -> (known after apply)
        load_balancer_type               = "network"
        name                             = "cf-proxy-aws-lod"
      ~ security_groups                  = [] -> (known after apply)
      ~ subnets                          = [
          - "subnet-00298114be3a075ad",
          - "subnet-079bcbe2ddc2660a4",
          - "subnet-0c32554373923c9e5",
        ] -> (known after apply) # forces replacement
      ~ vpc_id                           = "vpc-0828b9d093c4347b0" -> (known after apply)
      ~ zone_id                          = "XXXXXXX" -> (known after apply)

      - access_logs {
          - enabled = false -> null
        }

      - subnet_mapping {
          - subnet_id = "subnet-00298114be3a075ad" -> null
        }
      - subnet_mapping {
          - subnet_id = "subnet-079bcbe2ddc2660a4" -> null
        }
      - subnet_mapping {
          - subnet_id = "subnet-0c32554373923c9e5" -> null
        }
      + subnet_mapping {
          + allocation_id = (known after apply)
          + subnet_id     = (known after apply)
        }
    }
```